{
  "architectures": ["Qwen3MoeForCausalLM"],
  "num_experts": 128,
  "num_experts_per_tok": 8,
  "moe_intermediate_size": 768,
  "intermediate_size": 768,
  "hidden_size": 2048,
  "dtype": "float16",
  "torch_dtype": "float16",
  "model_type": "qwen3_moe",
  "vocab_size": 151936,
  "num_hidden_layers": 48,
  "num_attention_heads": 32,
  "num_key_value_heads": 4
}
