{
  "architectures": ["MixtralForCausalLM"],
  "num_local_experts": 8,
  "num_experts_per_tok": 2,
  "intermediate_size": 14336,
  "hidden_size": 4096,
  "dtype": "float16",
  "torch_dtype": "float16",
  "model_type": "mixtral",
  "vocab_size": 32000,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 8
}
